---
kind: property
id: P:Autodesk.Revit.DB.CurveByPointsArray.IsEmpty
source: html/5a90ff84-c233-50b6-4eb8-70cf17461f70.htm
---
# Autodesk.Revit.DB.CurveByPointsArray.IsEmpty Property

Test to see if the array is empty.

## Syntax (C#)
```csharp
public virtual bool IsEmpty { get; }
```

## Remarks
If the array is empty then True will be returned, otherwise False.